// 2021-11-16_Webinar_Homework2-4.cpp
// homework (tasks 2, 3, 4) - webinar of November 16, 2021 
// Created by Daniil Nesterov (e-mail: maidanov1991@yandex.ru)

#include <iostream> 
#include <clocale>

using namespace std; 

int main()
{
    setlocale(LC_ALL, "Russian"); 

//Task 2.===========================================================================================================================================//
// Дано целое число. Если оно меньше или равно 21, то выведите на экран разницу между этим числом и числом 21. 
// Если же заданное число больше, чем 21, необходимо вывести удвоенную разницу между этим числом и 21. 
// При выполнении задания следует использовать тернарный оператор(? : ).
    
    cout << "Задание 2:\n";

    int16_t nNumber{ 0 }; 
    int32_t nResult{ 0 };

    cout << "Пожалуйста, введите целое число в диапазоне от -32'768 до 32'767: "; 
    
    cin >> nNumber; 

    nResult = (nNumber <= 21) ? (nNumber - 21) : ((nNumber - 21) * 2); 

    cout << nResult << "\n\n\n";  

//Конец Task 2.======================================================================================================================================//


//Task 3.===========================================================================================================================================//
// * Описать трёхмерный целочисленный массив, размером 3х3х3 и указатель на значения внутри массива, 
// и при помощи операции разыменования вывести на экран значение центральной ячейки получившегося куба[1][1][1].

    cout << "Задание 3:\n"; 

    int aArray3d[3][3][3] = { {{12, -5, 70}, {-900, 219, 3}, {4, -20, 84}}, 
                            {{4, 1024, -6}, {2, 777, 99}, {64, 32, 55}}, 
                            {{-33, -409, 12}, {300, 400, 500}, {57, 8, -19}} };

    int* pArray3d{ &aArray3d[1][1][1] };
   
    cout << "aArray3d[1][1][1] = " << *pArray3d << "\n\n\n"; 

//Конец Task 3.======================================================================================================================================//

//Task 4.===========================================================================================================================================//
// ** Написать программу, вычисляющую выражение из первого задания, а переменные для неё объявлены и инициализировать в другом cpp файле. 
// Используйте extern.
    
    cout << "Задание 4:\n"; 
    
    extern const int a, b, c, d;

    string sExpression{ "a * (b + (c / d)) = " }; //текстовая запись выражения определена как string переменная (для удобства) 

    cout << "Исходные целочисленные константы: a = " << a << ", b = " << b << ", c = " << c << ", d = " << d << "\n";
    cout << "Без изменения типа данных:        " << sExpression << a * (b + (c / d)) << "\n";
    cout << "С применением static_cast<float>: " << sExpression << a * (b + (static_cast<float>(c) / d)) << "\n";
    cout << "С применением C-Style cast:       " << sExpression << a * (b + (float(c) / d)) << "\n\n";

//Конец Task 4.======================================================================================================================================//

    return 0; 
}